Biosense-Capstone/BIOSENSE-HEADSET-FINAL/Application/CC1350_BIOSENSE_HEADBAND.c
const uint_least8_t NVS_count = CC1350_BIOSENSE_HEADBAND_NVSCOUNT;

/*
 *  =============================== PIN ===============================
 */
#include <ti/drivers/PIN.h>
#include <ti/drivers/pin/PINCC26XX.h>

const PIN_Config BoardGpioInitTable[] = {
    CC1350_BIOSENSE_HEADBAND_PIN_RLED | PIN_GPIO_OUTPUT_EN | PIN_GPIO_LOW | PIN_PUSHPULL | PIN_DRVSTR_MAX,          /* LED initially off             */
    PIN_TERMINATE
};

const PINCC26XX_HWAttrs PINCC26XX_hwAttrs = {
    .intPriority = ~0,
    .swiPriority = 0
};

/*
 *  =============================== Power ===============================
 */
#include <ti/drivers/Power.h>
#include <ti/drivers/power/PowerCC26XX.h>

const PowerCC26XX_Config PowerCC26XX_config = {
    .policyInitFxn      = NULL,
    .policyFxn          = &PowerCC26XX_standbyPolicy,
    .calibrateFxn       = &PowerCC26XX_calibrate,
    .enablePolicy       = true,
    .calibrateRCOSC_LF  = true,
    .calibrateRCOSC_HF  = true,
};

/*
 *  =============================== PWM ===============================
 *  Remove unused entries to reduce flash usage both in Board.c and Board.h
 */
#include <ti/drivers/PWM.h>
#include <ti/drivers/pwm/PWMTimerCC26XX.h>

PWMTimerCC26XX_Object pwmtimerCC26xxObjects[CC1350_BIOSENSE_HEADBAND_PWMCOUNT];

const PWMTimerCC26XX_HwAttrs pwmtimerCC26xxHWAttrs[CC1350_BIOSENSE_HEADBAND_PWMCOUNT] = {
    { .pwmPin = CC1350_BIOSENSE_HEADBAND_PWMPIN0, .gpTimerUnit = CC1350_BIOSENSE_HEADBAND_GPTIMER0A },
    { .pwmPin = CC1350_BIOSENSE_HEADBAND_PWMPIN1, .gpTimerUnit = CC1350_BIOSENSE_HEADBAND_GPTIMER0B },
    { .pwmPin = CC1350_BIOSENSE_HEADBAND_PWMPIN2, .gpTimerUnit = CC1350_BIOSENSE_HEADBAND_GPTIMER1A },
    { .pwmPin = CC1350_BIOSENSE_HEADBAND_PWMPIN3, .gpTimerUnit = CC1350_BIOSENSE_HEADBAND_GPTIMER1B },
    { .pwmPin = CC1350_BIOSENSE_HEADBAND_PWMPIN4, .gpTimerUnit = CC1350_BIOSENSE_HEADBAND_GPTIMER2A },
    { .pwmPin = CC1350_BIOSENSE_HEADBAND_PWMPIN5, .gpTimerUnit = CC1350_BIOSENSE_HEADBAND_GPTIMER2B },
    { .pwmPin = CC1350_BIOSENSE_HEADBAND_PWMPIN6, .gpTimerUnit = CC1350_BIOSENSE_HEADBAND_GPTIMER3A },
    { .pwmPin = CC1350_BIOSENSE_HEADBAND_PWMPIN7, .gpTimerUnit = CC1350_BIOSENSE_HEADBAND_GPTIMER3B },
};

const PWM_Config PWM_config[CC1350_BIOSENSE_HEADBAND_PWMCOUNT] = {
    { &PWMTimerCC26XX_fxnTable, &pwmtimerCC26xxObjects[CC1350_BIOSENSE_HEADBAND_PWM0], &pwmtimerCC26xxHWAttrs[CC1350_BIOSENSE_HEADBAND_PWM0] },
    { &PWMTimerCC26XX_fxnTable, &pwmtimerCC26xxObjects[CC1350_BIOSENSE_HEADBAND_PWM1], &pwmtimerCC26xxHWAttrs[CC1350_BIOSENSE_HEADBAND_PWM1] },
    { &PWMTimerCC26XX_fxnTable, &pwmtimerCC26xxObjects[CC1350_BIOSENSE_HEADBAND_PWM2], &pwmtimerCC26xxHWAttrs[CC1350_BIOSENSE_HEADBAND_PWM2] },
    { &PWMTimerCC26XX_fxnTable, &pwmtimerCC26xxObjects[CC1350_BIOSENSE_HEADBAND_PWM3], &pwmtimerCC26xxHWAttrs[CC1350_BIOSENSE_HEADBAND_PWM3] },
    { &PWMTimerCC26XX_fxnTable, &pwmtimerCC26xxObjects[CC1350_BIOSENSE_HEADBAND_PWM4], &pwmtimerCC26xxHWAttrs[CC1350_BIOSENSE_HEADBAND_PWM4] },
    { &PWMTimerCC26XX_fxnTable, &pwmtimerCC26xxObjects[CC1350_BIOSENSE_HEADBAND_PWM5], &pwmtimerCC26xxHWAttrs[CC1350_BIOSENSE_HEADBAND_PWM5] },
    { &PWMTimerCC26XX_fxnTable, &pwmtimerCC26xxObjects[CC1350_BIOSENSE_HEADBAND_PWM6], &pwmtimerCC26xxHWAttrs[CC1350_BIOSENSE_HEADBAND_PWM6] },
    { &PWMTimerCC26XX_fxnTable, &pwmtimerCC26xxObjects[CC1350_BIOSENSE_HEADBAND_PWM7], &pwmtimerCC26xxHWAttrs[CC1350_BIOSENSE_HEADBAND_PWM7] },
};

const uint_least8_t PWM_count = CC1350_BIOSENSE_HEADBAND_PWMCOUNT;

/*
 *  =============================== RF Driver ===============================
 */
#include <ti/drivers/rf/RF.h>

/*
 *  Board-specific callback function to set the correct antenna path.
 *
 *  This function is called by the RF driver on global driver events.
 *  It contains a default implementation to set the correct antenna path.
 *  This function is defined in the file CC1350_BIOSENSE_HEADBAND_fxns.c
 */
extern void rfDriverCallback(RF_Handle client, RF_GlobalEvent events, void *arg);

const RFCC26XX_HWAttrsV2 RFCC26XX_hwAttrs = {
    .hwiPriority        = ~0,     /* Lowest HWI priority */
    .swiPriority        = 0,      /* Lowest SWI priority */
    .xoscHfAlwaysNeeded = true,   /* Keep XOSC dependency while in stanby */

    /* Register the board specific callback */
    .globalCallback     = &rfDriverCallback,
    /* Subscribe the callback to both events */
    .globalEventMask    = RF_GlobalEventRadioSetup | RF_GlobalEventRadioPowerDown
};

/*
 *  =============================== SD ===============================
 */
#include <ti/drivers/SD.h>
#include <ti/drivers/sd/SDSPI.h>

SDSPI_Object sdspiObjects[CC1350_BIOSENSE_HEADBAND_SDCOUNT];

const SDSPI_HWAttrs sdspiHWAttrs[CC1350_BIOSENSE_HEADBAND_SDCOUNT] = {
    {
        .spiIndex = CC1350_BIOSENSE_HEADBAND_SPI0,
        .spiCsGpioIndex = CC1350_BIOSENSE_HEADBAND_SDSPI_CS
    }
};

const SD_Config SD_config[CC1350_BIOSENSE_HEADBAND_SDCOUNT] = {
    {
        .fxnTablePtr = &SDSPI_fxnTable,
        .object = &sdspiObjects[CC1350_BIOSENSE_HEADBAND_SDSPI0],
        .hwAttrs = &sdspiHWAttrs[CC1350_BIOSENSE_HEADBAND_SDSPI0]
    },
};

const uint_least8_t SD_count = CC1350_BIOSENSE_HEADBAND_SDCOUNT;

/*
 *  =============================== SPI DMA ===============================
 */
#include <ti/drivers/SPI.h>
#include <ti/drivers/spi/SPICC26XXDMA.h>

SPICC26XXDMA_Object spiCC26XXDMAObjects[CC1350_BIOSENSE_HEADBAND_SPICOUNT];

/*
 * NOTE: The SPI instances below can be used by the SD driver to communicate
 * with a SD card via SPI.  The 'defaultTxBufValue' fields below are set to 0xFF
 * to satisfy the SDSPI driver requirement.
 */
const SPICC26XXDMA_HWAttrsV1 spiCC26XXDMAHWAttrs[CC1350_BIOSENSE_HEADBAND_SPICOUNT] = {
    {
        .baseAddr           = SSI0_BASE,
        .intNum             = INT_SSI0_COMB,
        .intPriority        = ~0,
        .swiPriority        = 0,
        .powerMngrId        = PowerCC26XX_PERIPH_SSI0,
        .defaultTxBufValue  = 0xFF,
        .rxChannelBitMask   = 1<<UDMA_CHAN_SSI0_RX,
        .txChannelBitMask   = 1<<UDMA_CHAN_SSI0_TX,
        .mosiPin            = CC1350_BIOSENSE_HEADBAND_SPI0_MOSI,
        .misoPin            = CC1350_BIOSENSE_HEADBAND_SPI0_MISO,
        .clkPin             = CC1350_BIOSENSE_HEADBAND_SPI0_CLK,
        .csnPin             = CC1350_BIOSENSE_HEADBAND_SPI0_CSN,
        .minDmaTransferSize = 10
    },
    {
        .baseAddr           = SSI1_BASE,
        .intNum             = INT_SSI1_COMB,
        .intPriority        = ~0,
        .swiPriority        = 0,
        .powerMngrId        = PowerCC26XX_PERIPH_SSI1,
        .defaultTxBufValue  = 0xFF,
        .rxChannelBitMask   = 1<<UDMA_CHAN_SSI1_RX,
        .txChannelBitMask   = 1<<UDMA_CHAN_SSI1_TX,
        .mosiPin            = CC1350_BIOSENSE_HEADBAND_SPI1_MOSI,
        .misoPin            = CC1350_BIOSENSE_HEADBAND_SPI1_MISO,
        .clkPin             = CC1350_BIOSENSE_HEADBAND_SPI1_CLK,
        .csnPin             = CC1350_BIOSENSE_HEADBAND_SPI1_CSN,
        .minDmaTransferSize = 10
    }
};

const SPI_Config SPI_config[CC1350_BIOSENSE_HEADBAND_SPICOUNT] = {
    {
         .fxnTablePtr = &SPICC26XXDMA_fxnTable,
         .object      = &spiCC26XXDMAObjects[CC1350_BIOSENSE_HEADBAND_SPI0],
         .hwAttrs     = &spiCC26XXDMAHWAttrs[CC1350_BIOSENSE_HEADBAND_SPI0]
    },
    {
         .fxnTablePtr = &SPICC26XXDMA_fxnTable,
         .object      = &spiCC26XXDMAObjects[CC1350_BIOSENSE_HEADBAND_SPI1],
         .hwAttrs     = &spiCC26XXDMAHWAttrs[CC1350_BIOSENSE_HEADBAND_SPI1]
    },
};

const uint_least8_t SPI_count = CC1350_BIOSENSE_HEADBAND_SPICOUNT;

